lizhiok/FPInterro/Libraries/MDK_LIB/RL/CAN/Drivers/CAN_LPC29xx.c
/*----------------------------------------------------------------------------
 *      RL-ARM - CAN
 *----------------------------------------------------------------------------
 *      Name:    CAN_LPC29xx.c
 *      Purpose: CAN Driver, Hardware specific module for NXP LPC29xx
 *      Rev.:    V4.70
 *----------------------------------------------------------------------------
 *      This code is part of the RealView Run-Time Library.
 *      Copyright (c) 2004-2013 KEIL - An ARM Company. All rights reserved.
 *---------------------------------------------------------------------------*/

#include <RTL.h>                      /* RTX kernel functions & defines      */
#include <RTX_CAN.h>                  /* CAN Generic functions & defines     */
#include <LPC29xx.h>                  /* LPC29xx definitions                 */
#include "CAN_reg.h"                  /* LPC29xx CAN registers               */

#pragma diag_suppress 550

/* Values of bit time register for different baudrates
   NT = Nominal bit time = TSEG1 + TSEG2 + 3
   SP = Sample point     = ((1+TSEG1+1)/(1+TSEG1+1+TSEG2+1)) * 100%
                                            SAM,  SJW, TSEG1, TSEG2, NT,  SP */
const U32 CAN_BIT_TIME[] = {          0, /*             not used             */
                                      0, /*             not used             */
                                      0, /*             not used             */
                                      0, /*             not used             */
                             0x0001C000, /* 0+1,  3+1,   1+1,   0+1,  4, 75% */
                                      0, /*             not used             */
                             0x0012C000, /* 0+1,  3+1,   2+1,   1+1,  6, 67% */
                                      0, /*             not used             */
                             0x0023C000, /* 0+1,  3+1,   3+1,   2+1,  8, 63% */
                                      0, /*             not used             */
                             0x0025C000, /* 0+1,  3+1,   5+1,   2+1, 10, 70% */
                                      0, /*             not used             */
                             0x0036C000, /* 0+1,  3+1,   6+1,   3+1, 12, 67% */
                                      0, /*             not used             */
                                      0, /*             not used             */
                             0x0048C000, /* 0+1,  3+1,   8+1,   4+1, 15, 67% */
                             0x0049C000, /* 0+1,  3+1,   9+1,   4+1, 16, 69% */
                           };


/************************* CAN Hardware Configuration ************************/

// *** <<< Use Configuration Wizard in Context Menu >>> ***

// <o> CAN Peripheral Clock (in Hz) <1-1000000000>
//     <i> Default: 80000000 (= system clock)                                    
#define PCLK             80000000

// *** <<< End of Configuration section             >>> ***


/*----------------------------------------------------------------------------
 *      CAN RTX Hardware Specific Driver Functions
 *----------------------------------------------------------------------------
 *  Functions implemented in this module:
 *    static CAN_ERROR CAN_hw_set_baudrate (U32 ctrl, U32 baudrate)
 *           CAN_ERROR CAN_hw_setup        (U32 ctrl)
 *           CAN_ERROR CAN_hw_init         (U32 ctrl, U32 baudrate)
 *           CAN_ERROR CAN_hw_start        (U32 ctrl)
 *           CAN_ERROR CAN_hw_tx_empty     (U32 ctrl)
 *           CAN_ERROR CAN_hw_wr           (U32 ctrl, CAN_msg *msg)
 *    static      void CAN_hw_rd           (U32 ctrl, CAN_msg *msg)
 *           CAN_ERROR CAN_hw_set          (U32 ctrl, CAN_msg *msg)
 *           CAN_ERROR CAN_hw_rx_object    (U32 ctrl, U32 ch, U32 id, U32 object_para)
 *           CAN_ERROR CAN_hw_tx_object    (U32 ctrl, U32 ch,         U32 object_para)
 *    Interrupt fuctions
 *---------------------------------------------------------------------------*/

/* Static functions used only in this module                                 */
static void CAN_hw_rd          (U32 ctrl, CAN_msg *msg);
#if USE_CAN_CTRL1 == 1
  __irq void CAN0_Tx_Handler  (void);
  __irq void CAN0_Rx_Handler  (void);
#endif
#if USE_CAN_CTRL2 == 1
  __irq void CAN1_Tx_Handler  (void);
  __irq void CAN1_Rx_Handler  (void);
#endif


/************************* Auxiliary Functions *******************************/

/*------------------------ CAN_hw_set_baudrate ------------------------------
 *
 *  Setup the requested baudrate
 *
 *  Parameter:  ctrl:       Index of the hardware CAN controller (1 .. x)
 *              baudrate:   Baudrate
 *
 *  Return:     CAN_ERROR:  Error code
 *---------------------------------------------------------------------------*/

static CAN_ERROR CAN_hw_set_baudrate (U32 ctrl, U32 baudrate)  {
  U32 ctrl0 = ctrl-1;                 /* Controller index 0 .. x-1           */
  regCAN    *ptrcan    = (regCAN *) CAN_BASE[ctrl0];
  U32 result = 0;
  U32 nominal_time;

  /* Determine which nominal time to use for baudrate according to PCLK      */
  nominal_time = 16;

  /* Prepare value appropriate for bit time register                         */
  result  = (PCLK / nominal_time) / baudrate - 1;
  result &= 0x000003FF;
  result |= CAN_BIT_TIME[nominal_time];

  ptrcan->CCBT = result;              /* Set bit timing                      */

  return CAN_OK;
}


/*************************** Module Functions ********************************/

/*--------------------------- CAN_hw_setup ----------------------------------
 *
 *  Setup CAN transmit and receive PINs and interrupt vectors
 *
 *  Parameter:  ctrl:       Index of the hardware CAN controller (1 .. x)
 *
 *  Return:     CAN_ERROR:  Error code
 *---------------------------------------------------------------------------*/

CAN_ERROR CAN_hw_setup (U32 ctrl)  {

  /* Configure CAN/LIN clock = PLL clock / 2 = 80 MHz                        */
  IVNSS_CLK_CONF = (2UL << 24) | (1 << 11) | (1 << 2);

  switch (ctrl) {
    case 1: 
      #if USE_CAN_CTRL1 == 1
        SFSP0_0  = 0x06;              /* Configure P0.0  as hw CAN0 TxD      */
        SFSP0_1  = 0x06;              /* Configure P0.1  as hw CAN0 RxD      */
    
        /* Set interrupt vector for hw CAN0 Tx                               */
        INT_REQUEST_43 = (1 << 28) |  /* Enable setting of priority level    */
                         (1 << 27) |  /* Enable setting interrupt target     */
                         (1 << 26) |  /* Write enable of new settings        */
                         (1 << 16) |  /* Enable interrupt request            */
                         (1 <<  8) |  /* Interrupt target is IRQ interrupt   */
                         (15 << 0) ;  /* Priority level 15, disable nesting  */
        /* Set interrupt vector for hw CAN0 Rx                               */
        INT_REQUEST_37 = (1 << 28) |  /* Enable setting of priority level    */
                         (1 << 27) |  /* Enable setting interrupt target     */
                         (1 << 26) |  /* Write enable of new settings        */
                         (1 << 16) |  /* Enable interrupt request            */
                         (1 <<  8) |  /* Interrupt target is IRQ interrupt   */
                         (15 << 0) ;  /* Priority level 15, disable nesting  */
      #endif
      break;
    case 2: 
      #if USE_CAN_CTRL2 == 1
        SFSP0_24 = 0x06;              /* Configure P0.24 as hw CAN1 TxD      */
        SFSP0_25 = 0x06;              /* Configure P0.25 as hw CAN1 RxD      */
    
        /* Set interrupt vector for hw CAN1 Tx                               */
        INT_REQUEST_44 = (1 << 28) |  /* Enable setting of priority level    */
                         (1 << 27) |  /* Enable setting interrupt target     */
                         (1 << 26) |  /* Write enable of new settings        */
                         (1 << 16) |  /* Enable interrupt request            */
                         (1 <<  8) |  /* Interrupt target is IRQ interrupt   */
                         (15 << 0) ;  /* Priority level 15, disable nesting  */
        /* Set interrupt vector for hw CAN1 Rx                               */
        INT_REQUEST_38 = (1 << 28) |  /* Enable setting of priority level    */
                         (1 << 27) |  /* Enable setting interrupt target     */
                         (1 << 26) |  /* Write enable of new settings        */
                         (1 << 16) |  /* Enable interrupt request            */
                         (1 <<  8) |  /* Interrupt target is IRQ interrupt   */
                         (15 << 0) ;  /* Priority level 15, disable nesting  */
      #endif
      break;
    default:
      return CAN_UNEXIST_CTRL_ERROR;
  }

  return CAN_OK;
}


