lizhiok/FPInterro/Libraries/MDK_LIB/RL/CAN/Drivers/CAN_LPC29xx.c
  /* Acceptance Filter Memory full                                           */
  if ((((CAN_std_cnt + 1) >> 1) + CAN_ext_cnt) >= 512)
    return CAN_OBJECTS_FULL_ERROR;

  /* Setup Acceptance Filter Configuration                                   
     Acceptance Filter Mode Register = Off                                   */
  ptrcan_afr->CAMODE = 1;

  if ((object_para & FORMAT_TYPE) == STANDARD_TYPE)  { /* Add mask for std id*/
    id |= ctrl << 13;                 /* Add controller number               */
    id &= 0x0000F7FF;                 /* Mask out 16-bits of ID              */

    /* Move all remaining extended mask entries one place up                 
       if new entry will increase standard ID filters list                   */
    if ((CAN_std_cnt & 0x0001) == 0 && CAN_ext_cnt != 0) {
      cnt1   = (CAN_std_cnt >> 1);
      bound1 = CAN_ext_cnt;
      buf0   = ptrcan_afm->mask[cnt1];
      while (bound1--)  {
        cnt1++;
        buf1 = ptrcan_afm->mask[cnt1];
        ptrcan_afm->mask[cnt1] = buf0;
        buf0 = buf1;
      }        
    }

    if (CAN_std_cnt == 0)  {          /* For entering first  ID              */
      ptrcan_afm->mask[0] = 0x0000FFFF | (id << 16);
    }  else if (CAN_std_cnt == 1)  {  /* For entering second ID              */
      if ((ptrcan_afm->mask[0] >> 16) > id)
        ptrcan_afm->mask[0] = (ptrcan_afm->mask[0] >> 16) | (id << 16);
      else
        ptrcan_afm->mask[0] = (ptrcan_afm->mask[0] & 0xFFFF0000) | id;
    }  else  {
      /* Find where to insert new ID                                         */
      cnt1 = 0;
      cnt2 = CAN_std_cnt;
      bound1 = (CAN_std_cnt - 1) >> 1;
      while (cnt1 <= bound1)  {       /* Loop through standard existing IDs  */
        if ((ptrcan_afm->mask[cnt1] >> 16) > id)  {
          cnt2 = cnt1 * 2;
          break;
        }
        if ((ptrcan_afm->mask[cnt1] & 0x0000FFFF) > id)  {
          cnt2 = cnt1 * 2 + 1;
          break;
        }
        cnt1++;                       /* cnt1 = U32 where to insert new ID   */
      }                               /* cnt2 = U16 where to insert new ID   */

      if (cnt1 > bound1)  {           /* Adding ID as last entry             */
        if ((CAN_std_cnt & 0x0001) == 0)/* Even number of IDs exists         */
          ptrcan_afm->mask[cnt1]  = 0x0000FFFF | (id << 16);
        else                              /* Odd  number of IDs exists       */
          ptrcan_afm->mask[cnt1]  = (ptrcan_afm->mask[cnt1] & 0xFFFF0000) | id;
      }  else  {
        buf0 = ptrcan_afm->mask[cnt1];/* Remember current entry            */
        if ((cnt2 & 0x0001) == 0)     /* Insert new mask to even address     */
          buf1 = (id << 16) | (buf0 >> 16);
        else                          /* Insert new mask to odd  address     */
          buf1 = (buf0 & 0xFFFF0000) | id;
     
        ptrcan_afm->mask[cnt1] = buf1;/* Insert mask                       */

        bound1 = CAN_std_cnt >> 1;
        /* Move all remaining standard mask entries one place up             */
        while (cnt1 < bound1)  {
          cnt1++;
          buf1  = ptrcan_afm->mask[cnt1];
          ptrcan_afm->mask[cnt1] = (buf1 >> 16) | (buf0 << 16);
          buf0  = buf1;
        }

        if ((CAN_std_cnt & 0x0001) == 0)/* Even number of IDs exists         */
          ptrcan_afm->mask[cnt1] = (ptrcan_afm->mask[cnt1] & 0xFFFF0000) | (0x0000FFFF);
      }
    }
    CAN_std_cnt++;
  }  else  {                          /* Add mask for extended identifiers   */
    id |= (ctrl) << 29;               /* Add controller number               */

    cnt1 = ((CAN_std_cnt + 1) >> 1);
    cnt2 = 0;
    while (cnt2 < CAN_ext_cnt)  {     /* Loop through extended existing masks*/
      if (ptrcan_afm->mask[cnt1] > id)
        break;
      cnt1++;                         /* cnt1 = U32 where to insert new mask */
      cnt2++;
    }

    buf0 = ptrcan_afm->mask[cnt1];  /* Remember current entry              */
    ptrcan_afm->mask[cnt1] = id;    /* Insert mask                         */

    CAN_ext_cnt++;

    bound1 = CAN_ext_cnt - 1;
    /* Move all remaining extended mask entries one place up                 */
    while (cnt2 < bound1)  {
      cnt1++;
      cnt2++;
      buf1 = ptrcan_afm->mask[cnt1];
      ptrcan_afm->mask[cnt1] = buf0;
      buf0 = buf1;
    }        
  }
  
  /* Calculate std ID start address (buf0) and ext ID start address (buf1)   */
  buf0 = ((CAN_std_cnt + 1) >> 1) << 2;
  buf1 = buf0 + (CAN_ext_cnt << 2);

  /* Setup acceptance filter pointers                                        */
  ptrcan_afr->CASFESA = 0;
  ptrcan_afr->CASFGSA = buf0;
  ptrcan_afr->CAEFESA = buf0;
  ptrcan_afr->CAEFGSA = buf1;
  ptrcan_afr->CAEOTA  = buf1;

  ptrcan_afr->CAMODE  = 0;            /* Use acceptance filter               */

  return CAN_OK;
}

/*--------------------------- CAN_hw_tx_object ------------------------------
 *
 *  This function has no usage on LPC2xxx, and so it does nothing
 *
 *  Parameter:  ctrl:       Index of the hardware CAN controller (1 .. x)
 *              ch:         Ignored for LPC2xxx
 *              id:         CAN message identifier
 *              object_para:Object parameters (standard or extended format, 
 *                          data or remote frame)
 *
 *  Return:     CAN_ERROR:  Error code
 *---------------------------------------------------------------------------*/

CAN_ERROR CAN_hw_tx_object (U32 ctrl, U32 ch, U32 object_para)  {

  return CAN_OK;
}


/************************* Interrupt Functions *******************************/

#if USE_CAN_CTRL1 == 1

#define CTRL0                 0
#define CTRL                  1
#define ptrCANc               ((regCAN *)CAN1_BASE)

/*--------------------------- CAN0_Tx_Handler ------------------------------
 *
 *  CAN transmit interrupt function for controller 1 (hw CAN0)
 *  If there are messages in mailbox for transmit it writes it to hardware
 *  and starts the transmission on controller 1 (hw CAN0)
 *
 *  Parameter:  none
 *
 *  Return:     none
 *---------------------------------------------------------------------------*/

__irq void CAN0_Tx_Handler (void)  {
  CAN_msg *ptrmsg;

  /* If there is message in mailbox ready for send, 
     read the message from mailbox and send it                               */
  if (isr_mbx_receive (MBX_tx_ctrl[CTRL0], (void **)&ptrmsg) != OS_R_OK) {
    CAN_hw_wr (CTRL, ptrmsg);
    _free_box(CAN_mpool, ptrmsg);
  } else {
    isr_sem_send(wr_sem[CTRL0]);      /* Return a token back to semaphore    */
  }

  /* Read from interrupt register to acknowledge interrupt                   */
  ptrCANc->CCIC;
}


/*--------------------------- CAN0_Rx_Handler ------------------------------
 *
 *  CAN receive interrupt function, for CAN controller 1 (hw CAN0)
 *  Reads message from hardware registers and puts it into receive mailbox
 *  for controller 1 (hw CAN0)
 *
 *  Parameter:  none
 *
 *  Return:     none
 *---------------------------------------------------------------------------*/

__irq void CAN0_Rx_Handler (void)  {
  CAN_msg *ptrmsg;

  /* If mailbox isn't full read message from hardware and send it to message 
     queue                                                                   */
  if (os_mbx_check (MBX_rx_ctrl[CTRL0]) > 0) {
    ptrmsg = _alloc_box (CAN_mpool);
    if (ptrmsg) {
      CAN_hw_rd (CTRL, ptrmsg);
      isr_mbx_send (MBX_rx_ctrl[CTRL0], ptrmsg);
    }
  }

  ptrCANc->CCCMD = 0x04;              /* Release receive buffer              */
}

#endif


#if USE_CAN_CTRL2 == 1

#undef  CTRL0
#define CTRL0                 1
#undef  CTRL
#define CTRL                  2
#undef  ptrCANc
#define ptrCANc               ((regCAN *)CAN2_BASE)

/*--------------------------- CAN1_Tx_Handler ------------------------------
 *
 *  CAN transmit interrupt function for controller 2 (hw CAN1)
 *  If there are messages in mailbox for transmit it writes it to hardware
 *  and starts the transmission on controller 2 (hw CAN1)
 *
 *  Parameter:  none
 *
 *  Return:     none
 *---------------------------------------------------------------------------*/

__irq void CAN1_Tx_Handler (void)  {
  CAN_msg *ptrmsg;

  /* If there is message in mailbox ready for send, 
     read the message from mailbox and send it                               */
  if (isr_mbx_receive (MBX_tx_ctrl[CTRL0], (void **)&ptrmsg) != OS_R_OK) {
    CAN_hw_wr (CTRL, ptrmsg);
    _free_box(CAN_mpool, ptrmsg);
  } else {
    isr_sem_send(wr_sem[CTRL0]);      /* Return a token back to semaphore    */
  }

  /* Read from interrupt register to acknowledge interrupt                   */
  ptrCANc->CCIC;
}


/*--------------------------- CAN1_Rx_Handler ------------------------------
 *
 *  CAN receive interrupt function, for CAN controller 2 (hw CAN1)
 *  Reads message from hardware registers and puts it into receive mailbox
 *  for controller 2 (hw CAN1)
 *
 *  Parameter:  none
 *
 *  Return:     none
 *---------------------------------------------------------------------------*/

__irq void CAN1_Rx_Handler (void)  {
  CAN_msg *ptrmsg;

  /* If mailbox isn't full read message from hardware and send it to message 
     queue                                                                   */
  if (os_mbx_check (MBX_rx_ctrl[CTRL0]) > 0) {
    ptrmsg = _alloc_box (CAN_mpool);
    if (ptrmsg) {
      CAN_hw_rd (CTRL, ptrmsg);
      isr_mbx_send (MBX_rx_ctrl[CTRL0], ptrmsg);
    }
  }

  ptrCANc->CCCMD = 0x04;              /* Release receive buffer              */
}


#endif


/*----------------------------------------------------------------------------
 * end of file
 *---------------------------------------------------------------------------*/

